<template>
  <div>
    <el-dialog :visible="true" :show-close="false" class="terms-container">
      <p class="trems-name">服务条款</p>
      <p class="terms-title">服务条款的接受</p>
      <p>用户一经完成注册过程，即视为完全接受本协议的所有条款。</p>
      <p class="terms-title">服务说明</p>
      <p>聚川营销平台为用户提供移动应用广告的相关服务。平台保留不经事先通知因维修、升级或其他原因暂停本网站服务任何部分的权利。平台保留变更服务的权利。</p>
      <p class="terms-title">用户行为</p>
      <p>用户在使用聚川营销平台提供的服务时，不得发布含有以下内容的信息或应用：</p>
      <p>1. 违反国家宪法所确定的基本原则的；</p>
      <p>2. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
      <p>3. 损害国家荣誉和利益的；</p>
      <p>4. 煽动民族仇恨、民族歧视，破坏民族团结</p>
      <p>5. 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p>6. 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p>7. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
      <p>8. 侮辱或者诽谤他人，侵害他人合法权益的；</p>
      <p>9. 含有法律、行政法规禁止的其他内容的。</p>
      <p>用户不得用任何不正当手段损害本平台其他用户及本平台的利益及声誉。</p>
      <p>用户违反上述规定的一条或多条，本平台有权随时解除合作。</p>
      <p class="terms-title">免责声明</p>
      <p>用户请理解并接受：</p>
      <p>1. 聚川营销平台不担保所提供的服务一定能满足用户的要求，也不担保服务不会受中断。对服务的及时性、安全性、准确性不做担保。</p>
      <p>2. 用户下载或通过聚川营销平台取得的任何信息资料取决于用户自己，所存在的风险将完全由自己承担；因使用聚川营销平台服务而产生的一切后果也由用户自己承担，本平台对用户不承担任何责任。</p>
      <p class="terms-title">服务的修改、中断和终止</p>
      <p>聚川营销平台将尽力提供最好的服务，并在发生任何修改或中断服务时及时通知用户，但是聚川营销平台保留以下权利：</p>
      <p>1. 必要时修改或中断服务而不需通知用户的权利。</p>
      <p>2. 对于所有服务的中断或终止而造成的任何损失，无需对用户或任何第三方承担任何责任。</p>
      <p class="terms-title">其他</p>
      <p>服务条款最终解释权和修改权归聚川营销平台所有。</p>
      <slot />
    </el-dialog>
  </div>
</template>

<style lang="scss">
  .terms-container {
    color: #333;
    padding: 0 30px;
    overflow: hidden;
    .el-dialog__body {
      height: 600px;
      overflow: scroll;
    }
  }
  p {
    font-size: 16px;
    margin: 5px 0;
  }
  .trems-name {
    font-size: 34px;
    font-weight: bold;
  }
  .terms-title {
    font-size: 22px;
    font-weight: bold;
  }
</style>
